<?php
/* 
- Інкремент та декремент
*/

// Префіксний інкремент
$a=10;
echo '++$a повинно бути 11:' .++$a. '<br />';
echo '$a повинно бути 11:' .$a. '<br />';
// Постфіксний інкримент
$b=10;
echo '$b++ повинно бути 10:' .$b++. '<br />';
echo '$b повинно бути 11:' .$b. '<br />';
// Префіксний декремент
$c=45;
echo '--$c повинно бути 44:' .--$c. '<br />';
echo '$c повинно бути 44:' .$c. '<br />';
// Постфіксний декремент
$d=45;
echo '--$d повинно бути 45:'.$d--. '<br />';
echo '$d повинно бути 44:'.$d. '<br />';



