<?php

//Математичні дії зі змінними
// Додавання

$sum=5+5;
echo 'Сума чисел 5+5 дорівнює ' .$sum;
echo '<br>';
echo $sum;
echo '<br>';
// Різниця

$sub=49-56;
echo 'Різниця чисел 49 та 56 дорівнює ' .$sub;
echo '<br>';
echo "Різниця чисел 49 та 56 дорівнює " .$sub;
echo '<br>';
// Робимо висновок: працює як за одинарними так і подвійними лапками

// Добуток чисел

$mult=-4*5;
echo 'Добуток чисел -4 та 5 дорівнює '.$mult;
echo '<br>';

// Частка чисел
$div=45/9;
echo 'Частка від ділення чисел 45 та 9 дорівнює '.$div;
echo '<br>';

//echo ''.;

//Остача від частки
$modulo=45%10;
echo 'Остача від частки 45 та 10 дорівнює '.$modulo;
echo '<br>';
// Піднесення до степеню

$exp=7**5;
echo 'Піднесення числа 7 у степінь 5 дорівнює '.$exp;




